In [25]:
!pip install psycopg2-binary
!pip install sqlalchemy

Requirement already satisfied: psycopg2-binary in d:\github\python-streamlit\.venv\lib\site-packages (2.9.6)
Requirement already satisfied: sqlalchemy in d:\github\python-streamlit\.venv\lib\site-packages (2.0.9)
Requirement already satisfied: typing-extensions>=4.2.0 in d:\github\python-streamlit\.venv\lib\site-packages (from sqlalchemy) (4.5.0)
Requirement already satisfied: greenlet!=0.4.17 in d:\github\python-streamlit\.venv\lib\site-packages (from sqlalchemy) (2.0.2)

In [26]:
from sqlalchemy.engine import URL
import pandas as pd

In [27]:
connection_string = "DRIVER={ODBC Driver 17 for SQL Server};SERVER=localhost;DATABASE=Northwind;UID=Sa;PWD=Pass@Word1"
connection_url = URL.create("mssql+pyodbc", query={"odbc_connect": connection_string})

from sqlalchemy import create_engine
engine = create_engine(connection_url)

# Test query - select all data from the products table

In [28]:
query = "SELECT * FROM Products;"
df = pd.read_sql(query, engine)
print(df.head())

   ProductID                   ProductName  SupplierID  CategoryID
0          1                          Chai           1           1  \
1          2                         Chang           1           1
2          3                 Aniseed Syrup           1           2
3          4  Chef Anton's Cajun Seasoning           2           2
4          5        Chef Anton's Gumbo Mix           2           2

       QuantityPerUnit  UnitPrice  UnitsInStock  UnitsOnOrder  ReorderLevel
0   10 boxes x 20 bags      18.00            39             0            10  \
1   24 - 12 oz bottles      19.00            17            40            25
2  12 - 550 ml bottles      10.00            13            70            25
3       48 - 6 oz jars      22.00            53             0             0
4             36 boxes      21.35             0             0             0

   Discontinued
0         False
1         False
2         False
3         False
4          True

# 1. Get the names and the quantities in stock for each product.

In [32]:
query1 = """
SELECT ProductName,UnitsInStock  
FROM Products;
"""
pd.read_sql(query1, engine)

                        ProductName  UnitsInStock
0                              Chai            39
1                             Chang            17
2                     Aniseed Syrup            13
3      Chef Anton's Cajun Seasoning            53
4            Chef Anton's Gumbo Mix             0
..                              ...           ...
72                       Röd Kaviar           101
73                    Longlife Tofu             4
74             Rhönbräu Klosterbier           125
75                     Lakkalikööri            57
76  Original Frankfurter grüne Soße            32

[77 rows x 2 columns]

# 2. Get a list of current products (Product ID and name).

In [34]:

query2 = """
SELECT ProductID, ProductName
FROM Products;
"""
pd.read_sql(query2, engine)

    ProductID                      ProductName
0          17                     Alice Mutton
1           3                    Aniseed Syrup
2          40                 Boston Crab Meat
3          60                Camembert Pierrot
4          18                 Carnarvon Tigers
..        ...                              ...
72          7  Uncle Bob's Organic Dried Pears
73         50                 Valkoinen suklaa
74         63                     Vegie-spread
75         64        Wimmers gute Semmelknödel
76         47                    Zaanse koeken

[77 rows x 2 columns]

# 3. Get a list of the most and least expensive products (name and unit price).

In [35]:

query3 = """
SELECT ProductName, UnitPrice 
FROM Products 
WHERE UnitPrice > 100 OR UnitPrice < 5
ORDER BY UnitPrice DESC;
"""
pd.read_sql(query3, engine)

               ProductName  UnitPrice
0            Côte de Blaye     263.50
1  Thüringer Rostbratwurst     123.79
2       Guaraná Fantástica       4.50
3                  Geitost       2.50

# 4. Get products that cost less than $20

In [36]:
query4 = """
SELECT ProductName, UnitPrice
FROM Products
WHERE UnitPrice < 20
ORDER BY UnitPrice ASC;
"""
pd.read_sql(query4, engine)

                        ProductName  UnitPrice
0                           Geitost       2.50
1                Guaraná Fantástica       4.50
2                             Konbu       6.00
3                          Filo Mix       7.00
4                         Tourtière       7.45
5              Rhönbräu Klosterbier       7.75
6                          Tunnbröd       9.00
7        Teatime Chocolate Biscuits       9.20
8                     Zaanse koeken       9.50
9                       Rogede sild       9.50
10  Jack's New England Clam Chowder       9.65
11              Sir Rodney's Scones      10.00
12                    Aniseed Syrup      10.00
13                    Longlife Tofu      10.00
14                        Spegesild      12.00
15              Scottish Longbreads      12.50
16                Gorgonzola Telino      12.50
17                        Chocolade      12.75
18  Original Frankfurter grüne Soße      13.00
19           Escargots de Bourgogne      13.25
20        Laughing Lumberjack Lager      14.00
21    Singaporean Hokkien Fried Mee      14.00
22          NuNuCa Nuß-Nougat-Creme      14.00
23                    Sasquatch Ale      14.00
24                    Outback Lager      15.00
25                       Röd Kaviar      15.00
26                     Genen Shouyu      15.50
27                 Valkoinen suklaa      16.25
28        Louisiana Hot Spiced Okra      17.00
29                          Pavlova      17.45
30                             Chai      18.00
31                   Steeleye Stout      18.00
32                 Chartreuse verte      18.00
33                     Lakkalikööri      18.00
34                 Boston Crab Meat      18.40
35                      Inlagd Sill      19.00
36                            Chang      19.00
37                     Gula Malacca      19.45
38                   Ravioli Angelo      19.50

# 5. Get products that cost between $15 and $25.

In [37]:
query5 = """
SELECT ProductName, UnitPrice
FROM Products
WHERE UnitPrice BETWEEN 15 AND 25;
"""
pd.read_sql(query5, engine)

                         ProductName  UnitPrice
0                               Chai      18.00
1                              Chang      19.00
2       Chef Anton's Cajun Seasoning      22.00
3             Chef Anton's Gumbo Mix      21.35
4       Grandma's Boysenberry Spread      25.00
5                     Queso Cabrales      21.00
6                               Tofu      23.25
7                       Genen Shouyu      15.50
8                            Pavlova      17.45
9                Gustaf's Knäckebröd      21.00
10                    Steeleye Stout      18.00
11                       Inlagd Sill      19.00
12                  Chartreuse verte      18.00
13                  Boston Crab Meat      18.40
14                      Gula Malacca      19.45
15                          Maxilaku      20.00
16                  Valkoinen suklaa      16.25
17                      Pâté chinois      24.00
18                    Ravioli Angelo      19.50
19  Louisiana Fiery Hot Pepper Sauce      21.05
20         Louisiana Hot Spiced Okra      17.00
21                     Outback Lager      15.00
22                       Flotemysost      21.50
23                        Röd Kaviar      15.00
24                      Lakkalikööri      18.00

# 6. Get products above average price.

In [39]:
query6 = """
SELECT ProductName, UnitPrice
FROM Products
WHERE UnitPrice > (
    SELECT AVG(UnitPrice)
    FROM Products
    );
"""
pd.read_sql(query6, engine)

                        ProductName  UnitPrice
0   Uncle Bob's Organic Dried Pears      30.00
1        Northwoods Cranberry Sauce      40.00
2                   Mishi Kobe Niku      97.00
3                             Ikura      31.00
4         Queso Manchego La Pastora      38.00
5                      Alice Mutton      39.00
6                  Carnarvon Tigers      62.50
7            Sir Rodney's Marmalade      81.00
8               Gumbär Gummibärchen      31.23
9                Schoggi Schokolade      43.90
10                Rössle Sauerkraut      45.60
11          Thüringer Rostbratwurst     123.79
12               Mascarpone Fabioli      32.00
13                    Côte de Blaye     263.50
14                      Ipoh Coffee      46.00
15            Manjimup Dried Apples      53.00
16                    Perth Pasties      32.80
17           Gnocchi di nonna Alice      38.00
18             Raclette Courdavault      55.00
19                Camembert Pierrot      34.00
20                   Tarte au sucre      49.30
21                     Vegie-spread      43.90
22        Wimmers gute Semmelknödel      33.25
23                 Gudbrandsdalsost      36.00
24           Mozzarella di Giovanni      34.80

# 7. Find the ten most expensive products.

In [42]:
query7 = """
SELECT TOP 10 ProductName, UnitPrice
FROM Products
ORDER BY UnitPrice DESC;
"""
pd.read_sql(query7, engine)

               ProductName  UnitPrice
0            Côte de Blaye     263.50
1  Thüringer Rostbratwurst     123.79
2          Mishi Kobe Niku      97.00
3   Sir Rodney's Marmalade      81.00
4         Carnarvon Tigers      62.50
5     Raclette Courdavault      55.00
6    Manjimup Dried Apples      53.00
7           Tarte au sucre      49.30
8              Ipoh Coffee      46.00
9        Rössle Sauerkraut      45.60

# 8. Get a list of discontinued products (Product ID and name).

In [44]:
query8 = """
SELECT ProductID, ProductName, Discontinued
FROM Products
WHERE Discontinued = 1;
"""
pd.read_sql(query8, engine)

   ProductID                    ProductName  Discontinued
0          5         Chef Anton's Gumbo Mix          True
1          9                Mishi Kobe Niku          True
2         17                   Alice Mutton          True
3         24             Guaraná Fantástica          True
4         28              Rössle Sauerkraut          True
5         29        Thüringer Rostbratwurst          True
6         42  Singaporean Hokkien Fried Mee          True
7         53                  Perth Pasties          True

# 9. Count current and discontinued products.

In [45]:
query9 = """
SELECT Discontinued, COUNT(*)
FROM Products
GROUP BY Discontinued;
"""
pd.read_sql(query9, engine)

   Discontinued
0         False  69
1          True   8

# 10. Find products with less units in stock than the quantity on order.

In [67]:
query10 = """
SELECT UnitsInStock, UnitsOnOrder 
FROM Products
WHERE UnitsInStock < UnitsOnOrder;
"""
pd.read_sql(query10, engine)

    UnitsInStock  UnitsOnOrder
0             17            40
1             13            70
2             22            30
3              3            40
4              0            70
5              9            40
6             11            50
7              5            70
8             15            70
9             10            60
10            22            80
11             4           100
12             6            10
13             4            20

# 11. Find the customer who had the highest order amount

In [68]:
query11 = """
SELECT TOP 1 CustomerID, COUNT(*)
FROM Orders
GROUP BY CustomerID
ORDER BY COUNT(*) DESC
"""
pd.read_sql(query11, engine)

  CustomerID
0      SAVEA  31

# 12. Get orders for a given employee and the according customer

In [53]:
query12 = """
SELECT *
FROM Orders
WHERE employeeID = 1;
"""
pd.read_sql(query12, engine)

,OrderID,CustomerID,EmployeeID,OrderDate,RequiredDate,ShippedDate,ShipVia,Freight,ShipName,ShipAddress,ShipCity,ShipRegion,ShipPostalCode,ShipCountry
0,10258,ERNSH,1,1996-07-17,1996-08-14,1996-07-23,1,140.51,Ernst Handel,Kirchgasse 6,Graz,None,8010,Austria
1,10270,WARTH,1,1996-08-01,1996-08-29,1996-08-02,1,136.54,Wartian Herkku,Torikatu 38,Oulu,None,90110,Finland
2,10275,MAGAA,1,1996-08-07,1996-09-04,1996-08-09,1,26.93,Magazzini Alimentari Riuniti,Via Ludovico il Moro 22,Bergamo,None,24100,Italy
3,10285,QUICK,1,1996-08-20,1996-09-17,1996-08-26,2,76.83,QUICK-Stop,Taucherstraße 10,Cunewalde,None,01307,Germany
4,10292,TRADH,1,1996-08-28,1996-09-25,1996-09-02,2,1.35,Tradiçao Hipermercados,"Av. Inês de Castro, 414",Sao Paulo,SP,05634-030,Brazil
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
118,11064,SAVEA,1,1998-05-01,1998-05-29,1998-05-04,1,30.09,Save-a-lot Markets,187 Suffolk Ln.,Boise,ID,83720,USA
119,11067,DRACD,1,1998-05-04,1998-05-18,1998-05-06,2,7.98,Drachenblut Delikatessen,Walserweg 21,Aachen,None,52066,Germany
120,11069,TORTU,1,1998-05-04,1998-06-01,1998-05-06,2,15.67,Tortuga Restaurante,Avda. Azteca 123,México D.F.,None,05033,Mexico
121,11071,LILAS,1,1998-05-05,1998-06-02,NaT,1,0.93,LILA-Supermercado,Carrera 52 con Ave. Bolívar #65-98 Llano Largo,Barquisimeto,Lara,3508,Venezuela
122,11077,RATTC,1,1998-05-06,1998-06-03,NaT,2,8.53,Rattlesnake Canyon Grocery,2817 Milton Dr.,Albuquerque,NM,87110,USA

# 14. Create views for some of these queries

In [81]:
view13 = """
CREATE VIEW EmployeeAge AS (
    SELECT EmployeeID, DATEDIFF(YY,HireDate,BirthDate) AS HiringAge
    FROM Employees
    );
"""
pd.read_sql("select * from EmployeeAge", engine)

   EmployeeID  HiringAge
0           1        -44
1           2        -40
2           3        -29
3           4        -56
4           5        -38
5           6        -30
6           7        -34
7           8        -36
8           9        -28

# Create a view of all the relevant columns from all the tables

In [83]:
view_all = """
CREATE VIEW AllData AS
	(SELECT 
		categories.CategoryID , categories.CategoryName ,
		products.ProductID , products.ProductName,products.UnitPrice,
		[Order Details].OrderID , [Order Details].Quantity,
		orders.CustomerID , orders.OrderDate , orders.ShippedDate , orders.ShipCity ,
		customers.city, customers.country
	FROM Categories
	JOIN Products on products.CategoryID = categories.CategoryID
	JOIN [Order Details] on [Order Details].ProductID = products.ProductID
	JOIN Orders on Orders.OrderID = [Order Details].OrderID
	JOIN Customers on Customers.CustomerID  = orders.CustomerID; 
	);
"""
pd.read_sql("select * from AllData", engine)

,CategoryID,CategoryName,ProductID,ProductName,UnitPrice,OrderID,Quantity,CustomerID,OrderDate,ShippedDate,ShipCity,city,country
0,4,Dairy Products,11,Queso Cabrales,21.00,10248,12,VINET,1996-07-04,1996-07-16,Reims,Reims,France
1,5,Grains/Cereals,42,Singaporean Hokkien Fried Mee,14.00,10248,10,VINET,1996-07-04,1996-07-16,Reims,Reims,France
2,4,Dairy Products,72,Mozzarella di Giovanni,34.80,10248,5,VINET,1996-07-04,1996-07-16,Reims,Reims,France
3,7,Produce,14,Tofu,23.25,10249,9,TOMSP,1996-07-05,1996-07-10,Münster,Münster,Germany
4,7,Produce,51,Manjimup Dried Apples,53.00,10249,40,TOMSP,1996-07-05,1996-07-10,Münster,Münster,Germany
...,...,...,...,...,...,...,...,...,...,...,...,...,...
2150,5,Grains/Cereals,64,Wimmers gute Semmelknödel,33.25,11077,2,RATTC,1998-05-06,NaT,Albuquerque,Albuquerque,USA
2151,2,Condiments,66,Louisiana Hot Spiced Okra,17.00,11077,1,RATTC,1998-05-06,NaT,Albuquerque,Albuquerque,USA
2152,8,Seafood,73,Röd Kaviar,15.00,11077,2,RATTC,1998-05-06,NaT,Albuquerque,Albuquerque,USA
2153,1,Beverages,75,Rhönbräu Klosterbier,7.75,11077,4,RATTC,1998-05-06,NaT,Albuquerque,Albuquerque,USA
2154,2,Condiments,77,Original Frankfurter grüne Soße,13.00,11077,2,RATTC,1998-05-06,NaT,Albuquerque,Albuquerque,USA

# Mark products as expensive of inexpensive

In [57]:

query14 = """
SELECT ProductID,
CASE
	WHEN UnitPrice > 150 THEN 'expensive' 
	ELSE 'Inexpensive' END
FROM [Order Details];
"""
pd.read_sql(query14, engine)

      ProductID
0            11  Inexpensive
1            42  Inexpensive
2            72  Inexpensive
3            14  Inexpensive
4            51  Inexpensive
...         ...          ...
2150         64  Inexpensive
2151         66  Inexpensive
2152         73  Inexpensive
2153         75  Inexpensive
2154         77  Inexpensive

[2155 rows x 2 columns]

# Calculate the average order value per country

In [59]:
query15 = """
SELECT 
	SUM([Order Details].productid *  [Order Details].UnitPrice -  [Order Details].discount) AS ordervalue,
	orders.shipcountry
FROM  [Order Details]
JOIN orders on orders.orderid =  [Order Details].orderid
GROUP BY orders.shipcountry
ORDER BY ordervalue DESC;
"""
pd.read_sql(query15, engine)

       ordervalue  shipcountry
0   416789.512388          USA
1   352223.571282      Germany
2   202892.870092       Brazil
3   188885.200197       France
4   134883.620041      Austria
5   128514.930056           UK
6   101164.829914    Venezuela
7   101080.000679       Sweden
8    78980.150024       Canada
9    69463.529966       Mexico
10   65365.029907      Ireland
11   65066.669985  Switzerland
12   56355.130157      Belgium
13   54847.850182      Denmark
14   53540.119888        Spain
15   50703.860146      Finland
16   45468.000229        Italy
17   40951.050171    Argentina
18   30176.510061     Portugal
19   23352.550011       Norway
20   15606.950073       Poland

# Calculate the total order value per country

In [ ]:
query16 = """
SELECT 
	SUM(order_details.product_id * order_details.UnitPrice - order_details.discount) AS order_value,
	orders.ship_country
FROM order_details
JOIN orders on orders.order_id = order_details.order_id
GROUP BY orders.ship_country
ORDER BY order_value DESC;
"""
pd.read_sql(query16, engine)

# Calculate the average order value per customer

In [ ]:
query17 = """
SELECT 
	AVG([Order Details].productid * [Order Details].UnitPrice - [Order Details].discount) AS ordervalue,
	orders.customerid
FROM [Order Details]
JOIN orders on orders.orderid = [Order Details].orderid
GROUP BY orders.customerid
ORDER BY ordervalue DESC;
"""
pd.read_sql(query17, engine)

# Calculate the average order value by date

In [63]:

query18 = """
SELECT 
	AVG([Order Details].productid * [Order Details].UnitPrice - [Order Details].discount) AS ordervalue,
	orders.orderdate
FROM [Order Details]
JOIN orders on orders.orderid = [Order Details].orderid
GROUP BY orders.orderdate
ORDER BY ordervalue DESC;
"""
pd.read_sql(query18, engine)

      ordervalue  orderdate
0    4614.438395 1998-01-06
1    4097.399857 1996-11-13
2    3658.933329 1997-04-25
3    3592.440039 1997-07-31
4    3424.349976 1997-03-19
..           ...        ...
475   114.000004 1997-03-03
476    89.925003 1996-11-07
477    70.300003 1996-10-23
478    24.000000 1997-01-06
479    14.400000 1996-09-30

[480 rows x 2 columns]

# Day with the highest order value

In [64]:
query19 = """
SELECT TOP 1
	MAX([Order Details].productid * [Order Details].UnitPrice - [Order Details].discount),
	orders.orderdate
FROM [Order Details]
JOIN orders on orders.orderid = [Order Details].orderid
GROUP BY orders.orderdate
ORDER BY orders.orderdate DESC;
"""
pd.read_sql(query19, engine)

                orderdate
0  2127.969971 1998-05-06

In [65]:
query20 = """
SELECT 
	[Order Details].orderid, SUM([Order Details].quantity * [Order Details].UnitPrice) AS ordervalue,
	orders.orderdate, orders.shipcountry
FROM [Order Details]
JOIN orders on orders.orderid = [Order Details].orderid
GROUP BY 
    [Order Details].orderid, 
    orders.orderdate, 
    orders.shipcountry;
"""
pd.read_sql(query20, engine)

     orderid  ordervalue  orderdate  shipcountry
0      10248       440.0 1996-07-04       France
1      10249      1863.4 1996-07-05      Germany
2      10250      1813.0 1996-07-08       Brazil
3      10251       670.8 1996-07-08       France
4      10252      3730.0 1996-07-09      Belgium
..       ...         ...        ...          ...
825    11073       300.0 1998-05-05       Mexico
826    11074       244.3 1998-05-06      Denmark
827    11075       586.0 1998-05-06  Switzerland
828    11076      1057.0 1998-05-06       France
829    11077      1374.6 1998-05-06          USA

[830 rows x 4 columns]